zephyrproject-rtos/zephyr/drivers/mspi/mspi_stm32_xspi.c
/*
 * Copyright (c) 2025 EXALT Technologies.
 * Copyright (c) 2026 Filip Stojanovic <filipembedded@gmail.com>
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 *
 * MSPI flash controller driver for stm32 series with multi-SPI peripherals
 * This driver is based on the stm32Cube HAL XSPI driver, either the legacy
 * STM32Cube generation or the STM32Cube2 (HAL2) one (CONFIG_STM32_HAL2,
 * e.g. STM32C5). The HAL-specific code is confined to the HAL adapter
 * functions at the top of this file; the shared logic never touches a HAL
 * name.
 *
 */

#define DT_DRV_COMPAT st_stm32_xspi_controller

#include <zephyr/cache.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/flash.h>
#include <zephyr/drivers/mspi.h>
#include <zephyr/logging/log.h>
#include <zephyr/drivers/dma/dma_stm32.h>
#include <zephyr/drivers/dma.h>
#include <stm32_ll_dma.h>
#include <zephyr/pm/device.h>
#include <zephyr/pm/device_runtime.h>
#include <zephyr/pm/policy.h>
#include <zephyr/irq.h>
#ifndef CONFIG_STM32_HAL2
#include <stm32_bitops.h>
#endif
#include "mspi_stm32.h"

LOG_MODULE_REGISTER(mspi_stm32_xspi, CONFIG_MSPI_LOG_LEVEL);

/* HAL2 I/O functions take an explicit timeout; same value the legacy HAL
 * uses for HAL_XSPI_TIMEOUT_DEFAULT_VALUE.
 */
#define MSPI_STM32_XSPI_TIMEOUT_MS 5000U

enum mspi_stm32_xspi_cmd_type {
	MSPI_STM32_XSPI_CMD_COMMON_CFG,
	MSPI_STM32_XSPI_CMD_READ_CFG,
	MSPI_STM32_XSPI_CMD_WRITE_CFG,
};

/*
 * HAL-neutral description of a regular command: the shared logic fills this
 * structure and mspi_stm32_xspi_send_cmd() translates it to the HAL command
 * type, so the HAL structure fields never leak into the shared code.
 */
struct mspi_stm32_xspi_cmd {
	enum mspi_stm32_xspi_cmd_type op_type;
	uint32_t instruction;
	uint32_t addr;
	/* Address bytes; 0 = no address phase */
	uint8_t addr_length;
	uint32_t dummy_cycles;
	uint32_t num_bytes;
	/* true = no data phase; num_bytes == 0 alone keeps an active
	 * zero-length data phase (required by the autopolling path).
	 */
	bool data_none;
};

static void xspi_lock_thread(const struct device *dev)
{
	struct mspi_stm32_data *dev_data = dev->data;

	k_sem_take(&dev_data->thread_sem, K_FOREVER);
}

static void xspi_unlock_thread(const struct device *dev)
{
	struct mspi_stm32_data *dev_data = dev->data;

	k_sem_give(&dev_data->thread_sem);
}

static uint32_t mspi_stm32_xspi_compute_prescaler(const struct mspi_stm32_conf *dev_cfg,
						  struct mspi_stm32_data *dev_data,
						  uint32_t ahb_clock_freq)
{
	uint32_t prescaler = MSPI_STM32_CLOCK_PRESCALER_MIN;

	for (; prescaler <= MSPI_STM32_CLOCK_PRESCALER_MAX; prescaler++) {
		dev_data->dev_cfg.freq = MSPI_STM32_CLOCK_COMPUTE(ahb_clock_freq, prescaler);
		if (dev_data->dev_cfg.freq <= dev_cfg->mspicfg.max_freq) {
			break;
		}
	}
	__ASSERT_NO_MSG(prescaler <= MSPI_STM32_CLOCK_PRESCALER_MAX);

	return prescaler;
}

/* Zephyr-side DMA channel setup, common to both HAL generations */
static int mspi_stm32_xspi_dma_stream_setup(void *hdma, struct stm32_stream *dma_stream)
{
	int ret;

	if (!device_is_ready(dma_stream->dev)) {
		LOG_ERR("DMA %s device not ready", dma_stream->dev->name);
		return -ENODEV;
	}

	dma_stream->cfg.user_data = hdma;
	/* This field is used to inform driver that it is overridden */
	dma_stream->cfg.linked_channel = STM32_DMA_HAL_OVERRIDE;
	ret = dma_config(dma_stream->dev, dma_stream->channel, &dma_stream->cfg);
	if (ret != 0) {
		LOG_ERR("Failed to configure DMA channel %d", dma_stream->channel);
		return ret;
	}

	if (dma_stream->cfg.source_data_size != dma_stream->cfg.dest_data_size) {
		LOG_ERR("DMA Source and destination data sizes not aligned");
		return -EINVAL;
	}

	return 0;
}

#if defined(CONFIG_STM32_HAL2)

/**
 * @brief Gives hal_xspi_regular_cmd_t with all parameters set except instruction, addr, size_byte
 */
static hal_xspi_regular_cmd_t mspi_stm32_xspi_prepare_cmd(uint8_t cfg_mode, uint8_t cfg_rate)
{
	/* Command empty structure: all-zero fields are valid HAL2 enum values
	 * (NONE / 8BIT / DISABLED).
	 */
	hal_xspi_regular_cmd_t cmd_tmp = {0};

	cmd_tmp.operation_type = HAL_XSPI_OPERATION_COMMON_CFG;
	cmd_tmp.instruction_width =
		((cfg_mode == MSPI_IO_MODE_OCTAL) && (cfg_rate != MSPI_DATA_RATE_S_D_D))
			? HAL_XSPI_INSTRUCTION_16BIT
			: HAL_XSPI_INSTRUCTION_8BIT;
	cmd_tmp.instruction_dtr_mode_status = (cfg_rate == MSPI_DATA_RATE_DUAL)
						      ? HAL_XSPI_INSTRUCTION_DTR_ENABLED
						      : HAL_XSPI_INSTRUCTION_DTR_DISABLED;

	cmd_tmp.alternate_bytes_mode = HAL_XSPI_ALTERNATE_BYTES_NONE;
	cmd_tmp.addr_dtr_mode_status =
		((cfg_rate == MSPI_DATA_RATE_DUAL) || (cfg_rate == MSPI_DATA_RATE_S_D_D)) ?
		HAL_XSPI_ADDR_DTR_ENABLED : HAL_XSPI_ADDR_DTR_DISABLED;
	/* addr_width must be set to 32bits for init and mem config phase */
	cmd_tmp.addr_width = HAL_XSPI_ADDR_32BIT;
	cmd_tmp.data_dtr_mode_status =
		((cfg_rate == MSPI_DATA_RATE_DUAL) || (cfg_rate == MSPI_DATA_RATE_S_D_D)) ?
		HAL_XSPI_DATA_DTR_ENABLED : HAL_XSPI_DATA_DTR_DISABLED;
	cmd_tmp.dqs_mode_status =
		((cfg_rate == MSPI_DATA_RATE_DUAL) || (cfg_rate == MSPI_DATA_RATE_S_D_D)) ?
		HAL_XSPI_DQS_ENABLED : HAL_XSPI_DQS_DISABLED;

	switch (cfg_mode) {
	case MSPI_IO_MODE_HEX_8_8_16:
		/* No 16-line data phase on this XSPI generation: use 8 lines,
		 * matching the legacy driver fallback.
		 */
	case MSPI_IO_MODE_OCTAL:
		cmd_tmp.instruction_mode = HAL_XSPI_INSTRUCTION_8LINES;
		cmd_tmp.addr_mode = HAL_XSPI_ADDR_8LINES;
		cmd_tmp.data_mode = HAL_XSPI_REGULAR_DATA_8LINES;
		break;

	case MSPI_IO_MODE_QUAD:
		cmd_tmp.instruction_mode = HAL_XSPI_INSTRUCTION_4LINES;
		cmd_tmp.addr_mode = HAL_XSPI_ADDR_4LINES;
		cmd_tmp.data_mode = HAL_XSPI_REGULAR_DATA_4LINES;
		break;

	case MSPI_IO_MODE_QUAD_1_4_4:
		cmd_tmp.instruction_mode = HAL_XSPI_INSTRUCTION_1LINE;
		cmd_tmp.addr_mode = HAL_XSPI_ADDR_4LINES;
		cmd_tmp.data_mode = HAL_XSPI_REGULAR_DATA_4LINES;
		break;

	case MSPI_IO_MODE_QUAD_1_1_4:
		cmd_tmp.instruction_mode = HAL_XSPI_INSTRUCTION_1LINE;
		cmd_tmp.addr_mode = HAL_XSPI_ADDR_1LINE;
		cmd_tmp.data_mode = HAL_XSPI_REGULAR_DATA_4LINES;
		break;

	case MSPI_IO_MODE_DUAL:
		cmd_tmp.instruction_mode = HAL_XSPI_INSTRUCTION_2LINES;
		cmd_tmp.addr_mode = HAL_XSPI_ADDR_2LINES;
		cmd_tmp.data_mode = HAL_XSPI_REGULAR_DATA_2LINES;
		break;

