zephyrproject-rtos/zephyr/drivers/mspi/mspi_stm32_xspi.c
	case MSPI_IO_MODE_DUAL_1_2_2:
		cmd_tmp.instruction_mode = HAL_XSPI_INSTRUCTION_1LINE;
		cmd_tmp.addr_mode = HAL_XSPI_ADDR_2LINES;
		cmd_tmp.data_mode = HAL_XSPI_REGULAR_DATA_2LINES;
		break;

	case MSPI_IO_MODE_DUAL_1_1_2:
		cmd_tmp.instruction_mode = HAL_XSPI_INSTRUCTION_1LINE;
		cmd_tmp.addr_mode = HAL_XSPI_ADDR_1LINE;
		cmd_tmp.data_mode = HAL_XSPI_REGULAR_DATA_2LINES;
		break;

	default:
		cmd_tmp.instruction_mode = HAL_XSPI_INSTRUCTION_1LINE;
		cmd_tmp.addr_mode = HAL_XSPI_ADDR_1LINE;
		cmd_tmp.data_mode = HAL_XSPI_REGULAR_DATA_1LINE;
		break;
	}

	return cmd_tmp;
}

static int mspi_stm32_xspi_send_cmd(const struct device *dev, uint8_t io_mode, uint8_t data_rate,
				    const struct mspi_stm32_xspi_cmd *cmd)
{
	struct mspi_stm32_data *dev_data = dev->data;
	hal_xspi_regular_cmd_t hal_cmd = mspi_stm32_xspi_prepare_cmd(io_mode, data_rate);

	switch (cmd->op_type) {
	case MSPI_STM32_XSPI_CMD_READ_CFG:
		hal_cmd.operation_type = HAL_XSPI_OPERATION_READ_CFG;
		break;
	case MSPI_STM32_XSPI_CMD_WRITE_CFG:
		hal_cmd.operation_type = HAL_XSPI_OPERATION_WRITE_CFG;
		break;
	default:
		/* prepare_cmd already selected the common configuration */
		break;
	}

	hal_cmd.instruction = cmd->instruction;
	hal_cmd.addr = cmd->addr;
	hal_cmd.dummy_cycle = cmd->dummy_cycles;
	hal_cmd.size_byte = cmd->num_bytes;

	if (cmd->addr_length == 0U) {
		hal_cmd.addr_mode = HAL_XSPI_ADDR_NONE;
	} else if ((cmd->op_type == MSPI_STM32_XSPI_CMD_COMMON_CFG) ||
		   (data_rate == MSPI_DATA_RATE_SINGLE)) {
		/* READ_CFG/WRITE_CFG at DTR rates keep the 32-bit width
		 * set by prepare_cmd.
		 */
		hal_cmd.addr_width = (cmd->addr_length == 4U) ? HAL_XSPI_ADDR_32BIT
							      : HAL_XSPI_ADDR_24BIT;
	}

	if (cmd->data_none) {
		hal_cmd.data_mode = HAL_XSPI_REGULAR_DATA_NONE;
	}

	if (HAL_XSPI_SendRegularCmd(&dev_data->hmspi.xspi, &hal_cmd,
				    MSPI_STM32_XSPI_TIMEOUT_MS) != HAL_OK) {
		return -EIO;
	}

	return 0;
}

/**
 * @brief Checks if the flash is currently operating in memory-mapped mode.
 */
static bool mspi_stm32_xspi_is_memorymap(const struct device *dev)
{
	struct mspi_stm32_data *dev_data = dev->data;

	return HAL_XSPI_GetState(&dev_data->hmspi.xspi) == HAL_XSPI_STATE_MEMORY_MAPPED_ACTIVE;
}

/**
 * @brief Sets the device back in indirect mode.
 */
static int mspi_stm32_xspi_memmap_off(const struct device *controller)
{
	struct mspi_stm32_data *dev_data = controller->data;
	hal_status_t hal_ret;

	hal_ret = HAL_XSPI_StopMemoryMappedMode(&dev_data->hmspi.xspi);
	if (hal_ret != HAL_OK) {
		LOG_ERR("MemMapped stop failed: %x", hal_ret);
		return -EIO;
	}
	return 0;
}

/* Enables the memory-mapping */
static int mspi_stm32_xspi_memmap_start(const struct device *controller)
{
	struct mspi_stm32_data *dev_data = controller->data;
	hal_xspi_memory_mapped_config_t s_mem_mapped_cfg;

	s_mem_mapped_cfg.timeout_activation = HAL_XSPI_TIMEOUT_DISABLE;
	s_mem_mapped_cfg.timeout_period_cycle = 0U;
	if (HAL_XSPI_StartMemoryMappedMode(&dev_data->hmspi.xspi, &s_mem_mapped_cfg) != HAL_OK) {
		return -EIO;
	}

	return 0;
}

static int mspi_stm32_xspi_autopoll_start(const struct device *dev, uint8_t match_value,
					  uint8_t match_mask)
{
	struct mspi_stm32_data *dev_data = dev->data;
	hal_xspi_auto_polling_config_t s_config = {0};

	/* Set the match to check if the bit is Reset */
	s_config.match_value = match_value;
	s_config.match_mask = match_mask;

	s_config.match_mode = HAL_XSPI_MATCH_MODE_AND;
	s_config.interval_cycle = MSPI_NOR_AUTO_POLLING_INTERVAL;
	s_config.automatic_stop_status = HAL_XSPI_AUTOMATIC_STOP_ENABLED;

	if (HAL_XSPI_ExecRegularAutoPoll_IT(&dev_data->hmspi.xspi, &s_config) != HAL_OK) {
		return -EIO;
	}

	return 0;
}

static int mspi_stm32_xspi_abort(const struct device *dev)
{
	struct mspi_stm32_data *dev_data = dev->data;

	if (HAL_XSPI_Abort(&dev_data->hmspi.xspi, MSPI_STM32_XSPI_TIMEOUT_MS) != HAL_OK) {
		return -EIO;
	}

	return 0;
}

static bool mspi_stm32_xspi_is_busy(const struct device *dev)
{
	struct mspi_stm32_data *dev_data = dev->data;

	return HAL_XSPI_IsActiveFlag(&dev_data->hmspi.xspi, HAL_XSPI_FLAG_BUSY) ==
	       HAL_XSPI_FLAG_ACTIVE;
}

static int mspi_hal_init(const struct mspi_stm32_conf *dev_cfg, struct mspi_stm32_data *dev_data,
			 uint32_t ahb_clock_freq)
{
	hal_xspi_config_t hal_cfg = {0};
	uint32_t prescaler =
		mspi_stm32_xspi_compute_prescaler(dev_cfg, dev_data, ahb_clock_freq);

	/* The hal_xspi_t instance values are the XSPI register base addresses */
	if (HAL_XSPI_Init(&dev_data->hmspi.xspi, (hal_xspi_t)(uintptr_t)dev_cfg->base) !=
	    HAL_OK) {
		LOG_ERR("MSPI Init failed");
		return -EIO;
	}

	hal_cfg.memory.mode = HAL_XSPI_MEMORY_SINGLE;
	hal_cfg.memory.type = (hal_xspi_memory_type_t)dev_cfg->mem_type;
	/* The HAL2 memory size values are the DCR1 DEVSIZE field content,
	 * while mem_size holds the raw DEVSIZE value.
	 */
	hal_cfg.memory.size_bit =
		(hal_xspi_memory_size_t)(dev_cfg->mem_size << XSPI_DCR1_DEVSIZE_Pos);
	hal_cfg.memory.wrap_size_byte = HAL_XSPI_WRAP_NOT_SUPPORTED;
	hal_cfg.memory.cs_boundary = (hal_xspi_cs_boundary_t)dev_cfg->cs_boundary;
	hal_cfg.timing.clk_prescaler = prescaler;
	hal_cfg.timing.shift = dev_cfg->ssht_enable ? HAL_XSPI_SAMPLE_SHIFT_HALFCYCLE
						    : HAL_XSPI_SAMPLE_SHIFT_NONE;
	hal_cfg.timing.hold = HAL_XSPI_DELAY_HOLD_NONE;
	hal_cfg.timing.cs_high_time_cycle = 1U;
	hal_cfg.timing.cs_refresh_time_cycle = 0U;
	hal_cfg.timing.dlyb_state = HAL_XSPI_DLYB_ON;

	if (HAL_XSPI_SetConfig(&dev_data->hmspi.xspi, &hal_cfg) != HAL_OK) {
		LOG_ERR("MSPI SetConfig failed");
		return -EIO;
	}

	if (HAL_XSPI_SetFifoThreshold(&dev_data->hmspi.xspi, MSPI_STM32_FIFO_THRESHOLD) !=
	    HAL_OK) {
		LOG_ERR("MSPI FIFO threshold config failed");
		return -EIO;
	}

	LOG_DBG("MSPI Init'd");
	return 0;
}

static int mspi_configure_delay_block(struct mspi_stm32_data *dev_data)
{
#if defined(DLYB_XSPI1) || defined(DLYB_XSPI2)
	uint32_t max_clock_phase;

	/* Delay the sampling clock by a quarter of the output clock period,
	 * as the legacy HAL does with PhaseSel = period / 4.
	 */
	if (HAL_XSPI_DLYB_CalculateMaxClockPhase(&dev_data->hmspi.xspi, &max_clock_phase) !=
	    HAL_OK) {
		LOG_ERR("XSPI DelayBlock failed");
		return -EIO;
	}

	if (HAL_XSPI_DLYB_SetConfigDelay(&dev_data->hmspi.xspi, max_clock_phase / 4U) != HAL_OK) {
		LOG_ERR("XSPI DelayBlock failed");
		return -EIO;
	}

