zephyrproject-rtos/zephyr/drivers/mspi/mspi_stm32_xspi.c
	/* The calls above restore the delay block to the state they found it
	 * in, which is disabled out of reset, so enable it explicitly.
	 */
	if (HAL_XSPI_DLYB_Enable(&dev_data->hmspi.xspi) != HAL_OK) {
		LOG_ERR("XSPI DelayBlock enable failed");
		return -EIO;
	}

	LOG_DBG("Delay Block Init");
#endif
	return 0;
}

static int mspi_stm32_xspi_dma_init(hal_dma_handle_t *hdma, struct stm32_stream *dma_stream)
{
	hal_dma_direct_xfer_config_t xfer_cfg;
	int ret;

	/*
	 * DMA configuration
	 * Due to use of XSPI HAL API in current driver,
	 * both HAL and Zephyr DMA drivers should be configured.
	 * The required configuration for Zephyr DMA driver should only provide
	 * the minimum information to inform the DMA slot will be in used and
	 * how to route callbacks.
	 */
	ret = mspi_stm32_xspi_dma_stream_setup(hdma, dma_stream);
	if (ret != 0) {
		return ret;
	}

	/*
	 * HAL expects a valid DMA channel.
	 * The channel is from 0 to 7 because of the STM32_DMA_STREAM_OFFSET
	 * in the dma_stm32 driver. The hal_dma_channel_t values are the DMA
	 * channel register base addresses.
	 */
	if (HAL_DMA_Init(hdma, (hal_dma_channel_t)(uint32_t)LL_DMA_GET_CHANNEL_INSTANCE(
					 dma_stream->reg, dma_stream->channel)) != HAL_OK) {
		LOG_ERR("XSPI DMA Init failed");
		return -EIO;
	}

	/* mspi_stm32_table_* hold LL values, which the hal_dma_* enums alias */
	xfer_cfg.request = (hal_dma_request_source_t)dma_stream->cfg.dma_slot;
	xfer_cfg.direction =
		(hal_dma_direction_t)mspi_stm32_table_direction[dma_stream->cfg.channel_direction];
	xfer_cfg.src_inc = (dma_stream->src_addr_increment) ? HAL_DMA_SRC_ADDR_INCREMENTED
							    : HAL_DMA_SRC_ADDR_FIXED;
	xfer_cfg.dest_inc = (dma_stream->dst_addr_increment) ? HAL_DMA_DEST_ADDR_INCREMENTED
							     : HAL_DMA_DEST_ADDR_FIXED;
	xfer_cfg.src_data_width = HAL_DMA_SRC_DATA_WIDTH_BYTE;
	xfer_cfg.dest_data_width = HAL_DMA_DEST_DATA_WIDTH_BYTE;
	xfer_cfg.priority =
		(hal_dma_priority_t)mspi_stm32_table_priority[dma_stream->cfg.channel_priority];

	if (HAL_DMA_SetConfigDirectXfer(hdma, &xfer_cfg) != HAL_OK) {
		LOG_ERR("XSPI DMA config failed");
		return -EIO;
	}

	LOG_DBG("XSPI with DMA transfer");
	return 0;
}

static int mspi_stm32_xspi_dma_link_tx(struct mspi_stm32_data *dev_data)
{
	if (HAL_XSPI_SetTxDMA(&dev_data->hmspi.xspi, &dev_data->hdma_tx) != HAL_OK) {
		return -EIO;
	}

	return 0;
}

static int mspi_stm32_xspi_dma_link_rx(struct mspi_stm32_data *dev_data)
{
	if (HAL_XSPI_SetRxDMA(&dev_data->hmspi.xspi, &dev_data->hdma_rx) != HAL_OK) {
		return -EIO;
	}

	return 0;
}

#else /* CONFIG_STM32_HAL2 */

/**
 * @brief Gives XSPI_RegularCmdTypeDef with all parameters set except Instruction, Address, NbData
 */
static XSPI_RegularCmdTypeDef mspi_stm32_xspi_prepare_cmd(uint8_t cfg_mode, uint8_t cfg_rate)
{
	/* Command empty structure */
	XSPI_RegularCmdTypeDef cmd_tmp = {0};

	cmd_tmp.OperationType = HAL_XSPI_OPTYPE_COMMON_CFG;
	cmd_tmp.InstructionWidth =
		((cfg_mode == MSPI_IO_MODE_OCTAL) && (cfg_rate != MSPI_DATA_RATE_S_D_D))
			? HAL_XSPI_INSTRUCTION_16_BITS
			: HAL_XSPI_INSTRUCTION_8_BITS;
	cmd_tmp.InstructionDTRMode = (cfg_rate == MSPI_DATA_RATE_DUAL)
					     ? HAL_XSPI_INSTRUCTION_DTR_ENABLE
					     : HAL_XSPI_INSTRUCTION_DTR_DISABLE;

	cmd_tmp.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;
	cmd_tmp.AddressDTRMode =
		((cfg_rate == MSPI_DATA_RATE_DUAL) || (cfg_rate == MSPI_DATA_RATE_S_D_D)) ?
		HAL_XSPI_ADDRESS_DTR_ENABLE : HAL_XSPI_ADDRESS_DTR_DISABLE;
	cmd_tmp.DataDTRMode = ((cfg_rate == MSPI_DATA_RATE_DUAL) ||
				(cfg_rate == MSPI_DATA_RATE_S_D_D)) ?
				HAL_XSPI_DATA_DTR_ENABLE
				: HAL_XSPI_DATA_DTR_DISABLE;
	/* AddressWidth must be set to 32bits for init and mem config phase */
	cmd_tmp.AddressWidth = HAL_XSPI_ADDRESS_32_BITS;
	cmd_tmp.DataDTRMode =
		((cfg_rate == MSPI_DATA_RATE_DUAL) || (cfg_rate == MSPI_DATA_RATE_S_D_D)) ?
		HAL_XSPI_DATA_DTR_ENABLE : HAL_XSPI_DATA_DTR_DISABLE;
	cmd_tmp.DQSMode =
		((cfg_rate == MSPI_DATA_RATE_DUAL) || (cfg_rate == MSPI_DATA_RATE_S_D_D)) ?
		HAL_XSPI_DQS_ENABLE : HAL_XSPI_DQS_DISABLE;

#ifdef XSPI_CCR_SIOO
	cmd_tmp.SIOOMode = HAL_XSPI_SIOO_INST_EVERY_CMD;
#endif /* XSPI_CCR_SIOO */

	switch (cfg_mode) {
	case MSPI_IO_MODE_HEX_8_8_16:
		cmd_tmp.InstructionMode = HAL_XSPI_INSTRUCTION_8_LINES;
		cmd_tmp.AddressMode = HAL_XSPI_ADDRESS_8_LINES;
#ifdef HAL_XSPI_DATA_16_LINES
		cmd_tmp.DataMode = HAL_XSPI_DATA_16_LINES;
#else
		cmd_tmp.DataMode = HAL_XSPI_DATA_8_LINES;
#endif
		break;

	case MSPI_IO_MODE_OCTAL:
		cmd_tmp.InstructionMode = HAL_XSPI_INSTRUCTION_8_LINES;
		cmd_tmp.AddressMode = HAL_XSPI_ADDRESS_8_LINES;
		cmd_tmp.DataMode = HAL_XSPI_DATA_8_LINES;
		break;

	case MSPI_IO_MODE_QUAD:
		cmd_tmp.InstructionMode = HAL_XSPI_INSTRUCTION_4_LINES;
		cmd_tmp.AddressMode = HAL_XSPI_ADDRESS_4_LINES;
		cmd_tmp.DataMode = HAL_XSPI_DATA_4_LINES;
		break;

	case MSPI_IO_MODE_QUAD_1_4_4:
		cmd_tmp.InstructionMode = HAL_XSPI_INSTRUCTION_1_LINE;
		cmd_tmp.AddressMode = HAL_XSPI_ADDRESS_4_LINES;
		cmd_tmp.DataMode = HAL_XSPI_DATA_4_LINES;
		break;

	case MSPI_IO_MODE_QUAD_1_1_4:
		cmd_tmp.InstructionMode = HAL_XSPI_INSTRUCTION_1_LINE;
		cmd_tmp.AddressMode = HAL_XSPI_ADDRESS_1_LINE;
		cmd_tmp.DataMode = HAL_XSPI_DATA_4_LINES;
		break;

	case MSPI_IO_MODE_DUAL:
		cmd_tmp.InstructionMode = HAL_XSPI_INSTRUCTION_2_LINES;
		cmd_tmp.AddressMode = HAL_XSPI_ADDRESS_2_LINES;
		cmd_tmp.DataMode = HAL_XSPI_DATA_2_LINES;
		break;

	case MSPI_IO_MODE_DUAL_1_2_2:
		cmd_tmp.InstructionMode = HAL_XSPI_INSTRUCTION_1_LINE;
		cmd_tmp.AddressMode = HAL_XSPI_ADDRESS_2_LINES;
		cmd_tmp.DataMode = HAL_XSPI_DATA_2_LINES;
		break;

	case MSPI_IO_MODE_DUAL_1_1_2:
		cmd_tmp.InstructionMode = HAL_XSPI_INSTRUCTION_1_LINE;
		cmd_tmp.AddressMode = HAL_XSPI_ADDRESS_1_LINE;
		cmd_tmp.DataMode = HAL_XSPI_DATA_2_LINES;
		break;

	default:
		cmd_tmp.InstructionMode = HAL_XSPI_INSTRUCTION_1_LINE;
		cmd_tmp.AddressMode = HAL_XSPI_ADDRESS_1_LINE;
		cmd_tmp.DataMode = HAL_XSPI_DATA_1_LINE;
		break;
	}

	return cmd_tmp;
}

static int mspi_stm32_xspi_send_cmd(const struct device *dev, uint8_t io_mode, uint8_t data_rate,
				    const struct mspi_stm32_xspi_cmd *cmd)
{
	struct mspi_stm32_data *dev_data = dev->data;
	XSPI_RegularCmdTypeDef hal_cmd = mspi_stm32_xspi_prepare_cmd(io_mode, data_rate);

	switch (cmd->op_type) {
	case MSPI_STM32_XSPI_CMD_READ_CFG:
		hal_cmd.OperationType = HAL_XSPI_OPTYPE_READ_CFG;
		break;
	case MSPI_STM32_XSPI_CMD_WRITE_CFG:
		hal_cmd.OperationType = HAL_XSPI_OPTYPE_WRITE_CFG;
		break;
	default:
		/* prepare_cmd already selected the common configuration */
		break;
	}

	hal_cmd.Instruction = cmd->instruction;
	hal_cmd.Address = cmd->addr;
	hal_cmd.DummyCycles = cmd->dummy_cycles;
	hal_cmd.DataLength = cmd->num_bytes;

