zephyrproject-rtos/zephyr/drivers/mspi/mspi_stm32_xspi.c
	if (cmd->addr_length == 0U) {
		hal_cmd.AddressMode = HAL_XSPI_ADDRESS_NONE;
	} else if ((cmd->op_type == MSPI_STM32_XSPI_CMD_COMMON_CFG) ||
		   (data_rate == MSPI_DATA_RATE_SINGLE)) {
		/* READ_CFG/WRITE_CFG at DTR rates keep the 32-bit width
		 * set by prepare_cmd.
		 */
		hal_cmd.AddressWidth = (cmd->addr_length == 4U) ? HAL_XSPI_ADDRESS_32_BITS
								: HAL_XSPI_ADDRESS_24_BITS;
	}

	if (cmd->data_none) {
		hal_cmd.DataMode = HAL_XSPI_DATA_NONE;
	}

	if (HAL_XSPI_Command(&dev_data->hmspi.xspi, &hal_cmd,
			     MSPI_STM32_XSPI_TIMEOUT_MS) != HAL_OK) {
		return -EIO;
	}

	return 0;
}

/**
 * @brief Checks if the flash is currently operating in memory-mapped mode.
 */
static bool mspi_stm32_xspi_is_memorymap(const struct device *dev)
{
	struct mspi_stm32_data *dev_data = dev->data;

	return stm32_reg_read_bits(&dev_data->hmspi.xspi.Instance->CR, XSPI_CR_FMODE) ==
	       XSPI_CR_FMODE;
}

/**
 * @brief Sets the device back in indirect mode.
 */
static int mspi_stm32_xspi_memmap_off(const struct device *controller)
{
	struct mspi_stm32_data *dev_data = controller->data;

	if (HAL_XSPI_Abort(&dev_data->hmspi.xspi) != HAL_OK) {
		LOG_ERR("MemMapped abort failed: %x", dev_data->hmspi.xspi.ErrorCode);
		return -EIO;
	}
	return 0;
}

/* Enables the memory-mapping */
static int mspi_stm32_xspi_memmap_start(const struct device *controller)
{
	struct mspi_stm32_data *dev_data = controller->data;
	XSPI_MemoryMappedTypeDef s_MemMappedCfg;

#ifdef XSPI_CR_NOPREF
	s_MemMappedCfg.NoPrefetchData = HAL_XSPI_AUTOMATIC_PREFETCH_ENABLE;
#ifdef XSPI_CR_NOPREF_AXI
	s_MemMappedCfg.NoPrefetchAXI = HAL_XSPI_AXI_PREFETCH_DISABLE;
#endif /* XSPI_CR_NOPREF_AXI */
#endif /* XSPI_CR_NOPREF */

	s_MemMappedCfg.TimeOutActivation = HAL_XSPI_TIMEOUT_COUNTER_DISABLE;
	if (HAL_XSPI_MemoryMapped(&dev_data->hmspi.xspi, &s_MemMappedCfg) != HAL_OK) {
		return -EIO;
	}

	return 0;
}

static int mspi_stm32_xspi_autopoll_start(const struct device *dev, uint8_t match_value,
					  uint8_t match_mask)
{
	struct mspi_stm32_data *dev_data = dev->data;
	XSPI_AutoPollingTypeDef s_config = {0};

	/* Set the match to check if the bit is Reset */
	s_config.MatchValue = match_value;
	s_config.MatchMask = match_mask;

	s_config.MatchMode = HAL_XSPI_MATCH_MODE_AND;
	s_config.IntervalTime = MSPI_NOR_AUTO_POLLING_INTERVAL;
	s_config.AutomaticStop = HAL_XSPI_AUTOMATIC_STOP_ENABLE;

	if (HAL_XSPI_AutoPolling_IT(&dev_data->hmspi.xspi, &s_config) != HAL_OK) {
		return -EIO;
	}

	return 0;
}

static int mspi_stm32_xspi_abort(const struct device *dev)
{
	struct mspi_stm32_data *dev_data = dev->data;

	if (HAL_XSPI_Abort(&dev_data->hmspi.xspi) != HAL_OK) {
		return -EIO;
	}

	return 0;
}

static bool mspi_stm32_xspi_is_busy(const struct device *dev)
{
	struct mspi_stm32_data *dev_data = dev->data;

	return HAL_XSPI_GET_FLAG(&dev_data->hmspi.xspi, HAL_XSPI_FLAG_BUSY) == SET;
}

static int mspi_hal_init(const struct mspi_stm32_conf *dev_cfg, struct mspi_stm32_data *dev_data,
			 uint32_t ahb_clock_freq)
{
	XSPI_HandleTypeDef *hxspi = &dev_data->hmspi.xspi;

	hxspi->Instance = dev_cfg->base;
	hxspi->Init.FifoThresholdByte = MSPI_STM32_FIFO_THRESHOLD;
	hxspi->Init.SampleShifting = dev_cfg->ssht_enable ? HAL_XSPI_SAMPLE_SHIFT_HALFCYCLE
							  : HAL_XSPI_SAMPLE_SHIFT_NONE;
	hxspi->Init.ChipSelectHighTimeCycle = 1;
	hxspi->Init.ClockMode = HAL_XSPI_CLOCK_MODE_0;
	hxspi->Init.ChipSelectBoundary = dev_cfg->cs_boundary;
	hxspi->Init.MemoryMode = HAL_XSPI_SINGLE_MEM;
	hxspi->Init.MemorySize = dev_cfg->mem_size;
	hxspi->Init.MemoryType = dev_cfg->mem_type;
	hxspi->Init.FreeRunningClock = HAL_XSPI_FREERUNCLK_DISABLE;
	hxspi->Init.ClockPrescaler =
		mspi_stm32_xspi_compute_prescaler(dev_cfg, dev_data, ahb_clock_freq);

#if defined(XSPI_DCR2_WRAPSIZE)
	hxspi->Init.WrapSize = HAL_XSPI_WRAP_NOT_SUPPORTED;
#endif

#if defined(XSPI_DCR1_DLYBYP)
	hxspi->Init.DelayBlockBypass = HAL_XSPI_DELAY_BLOCK_ON;
#endif /* XSPI_DCR1_DLYBYP */

	if (HAL_XSPI_Init(hxspi) != HAL_OK) {
		LOG_ERR("MSPI Init failed");
		return -EIO;
	}

	LOG_DBG("MSPI Init'd");
	return 0;
}

static int mspi_configure_delay_block(struct mspi_stm32_data *dev_data)
{
#if defined(DLYB_XSPI1) || defined(DLYB_XSPI2) || defined(DLYB_OCTOSPI1) || defined(DLYB_OCTOSPI2)
	HAL_XSPI_DLYB_CfgTypeDef cfg = {0};

	(void)HAL_XSPI_DLYB_GetClockPeriod(&dev_data->hmspi.xspi, &cfg);
	cfg.PhaseSel /= 4;

	if (HAL_XSPI_DLYB_SetConfig(&dev_data->hmspi.xspi, &cfg) != HAL_OK) {
		LOG_ERR("XSPI DelayBlock failed");
		return -EIO;
	}

	LOG_DBG("Delay Block Init");
#endif
	return 0;
}

static int mspi_stm32_xspi_dma_init(DMA_HandleTypeDef *hdma, struct stm32_stream *dma_stream)
{
	int ret;
	struct dma_config hal_dma_cfg;
	uint16_t source_addr_adj, dest_addr_adj;

	/*
	 * DMA configuration
	 * Due to use of XSPI HAL API in current driver,
	 * both HAL and Zephyr DMA drivers should be configured.
	 * The required configuration for Zephyr DMA driver should only provide
	 * the minimum information to inform the DMA slot will be in used and
	 * how to route callbacks.
	 */
	ret = mspi_stm32_xspi_dma_stream_setup(hdma, dma_stream);
	if (ret != 0) {
		return ret;
	}

	hal_dma_cfg = dma_stream->cfg;
	hal_dma_cfg.source_data_size = 1U;
	hal_dma_cfg.dest_data_size = 1U;

	source_addr_adj = dma_stream->src_addr_increment ?
		DMA_ADDR_ADJ_INCREMENT : DMA_ADDR_ADJ_NO_CHANGE;
	dest_addr_adj = dma_stream->dst_addr_increment ?
		DMA_ADDR_ADJ_INCREMENT : DMA_ADDR_ADJ_NO_CHANGE;

	ret = dma_stm32_zcfg_to_halcfg(dma_stream->dev, &hal_dma_cfg, &hdma->Init,
				       source_addr_adj, dest_addr_adj);
	if (ret < 0) {
		return ret;
	}

	/*
	 * HAL expects a valid DMA channel.
	 * The channel is from 0 to 7 because of the STM32_DMA_STREAM_OFFSET
	 * in the dma_stm32 driver
	 */
	hdma->Instance = LL_DMA_GET_CHANNEL_INSTANCE(dma_stream->reg, dma_stream->channel);

	/* Initialize DMA HAL */
	if (HAL_DMA_Init(hdma) != HAL_OK) {
		LOG_ERR("XSPI DMA Init failed");
		return -EIO;
	}

	if (HAL_DMA_ConfigChannelAttributes(hdma, DMA_CHANNEL_NPRIV) != HAL_OK) {
		LOG_ERR("XSPI DMA Init failed");
		return -EIO;
	}

	LOG_DBG("XSPI with DMA transfer");
	return 0;
}

static int mspi_stm32_xspi_dma_link_tx(struct mspi_stm32_data *dev_data)
{
	__HAL_LINKDMA(&dev_data->hmspi.xspi, hdmatx, dev_data->hdma_tx);

