zephyrproject-rtos/zephyr/drivers/mspi/mspi_stm32_xspi.c
	return 0;
}

static int mspi_stm32_xspi_dma_link_rx(struct mspi_stm32_data *dev_data)
{
	__HAL_LINKDMA(&dev_data->hmspi.xspi, hdmarx, dev_data->hdma_rx);

	return 0;
}

#if !defined(CONFIG_SOC_SERIES_STM32H7X)
/* weak function required for HAL compilation */
__weak HAL_StatusTypeDef HAL_DMA_Abort_IT(DMA_HandleTypeDef *hdma)
{
	ARG_UNUSED(hdma);
	return HAL_OK;
}

/* weak function required for HAL compilation */
__weak HAL_StatusTypeDef HAL_DMA_Abort(DMA_HandleTypeDef *hdma)
{
	ARG_UNUSED(hdma);
	return HAL_OK;
}
#endif /* !CONFIG_SOC_SERIES_STM32H7X */

#endif /* CONFIG_STM32_HAL2 */

/**
 * @brief Sets the device in Memory-Mapped mode.
 */
static int mspi_stm32_xspi_memmap_on(const struct device *controller)
{
	struct mspi_stm32_data *dev_data = controller->data;
	int ret;

	if (mspi_stm32_xspi_is_memorymap(controller)) {
		return 0;
	}

	/* Configure in MemoryMapped mode */
	if ((dev_data->dev_cfg.io_mode == MSPI_IO_MODE_SINGLE) &&
	    (dev_data->dev_cfg.addr_length != 4U)) {
		/* OPI mode and 3-bytes address size not supported by memory */
		LOG_ERR("MSPI_IO_MODE_SINGLE in 3Bytes addressing is not supported");
		return -EIO;
	}

	struct mspi_stm32_xspi_cmd cmd = {
		.op_type = MSPI_STM32_XSPI_CMD_READ_CFG,
		.instruction = dev_data->dev_cfg.read_cmd,
		.addr_length = (dev_data->ctx.xfer.addr_length == 4U) ? 4U : 3U,
		.dummy_cycles = dev_data->dev_cfg.rx_dummy,
	};

	/* Initialize the read command */
	ret = mspi_stm32_xspi_send_cmd(controller, dev_data->dev_cfg.io_mode,
				       dev_data->dev_cfg.data_rate, &cmd);
	if (ret != 0) {
		LOG_ERR("Failed to set memory mapped mode");
		return ret;
	}

	/* Initializes the program command */
	cmd.op_type = MSPI_STM32_XSPI_CMD_WRITE_CFG;
	cmd.instruction = dev_data->dev_cfg.write_cmd;
	cmd.dummy_cycles = dev_data->dev_cfg.tx_dummy;
	ret = mspi_stm32_xspi_send_cmd(controller, dev_data->dev_cfg.io_mode,
				       dev_data->dev_cfg.data_rate, &cmd);
	if (ret != 0) {
		LOG_ERR("Failed to set memory mapped mode");
		return ret;
	}

	ret = mspi_stm32_xspi_memmap_start(controller);
	if (ret != 0) {
		LOG_ERR("Failed to enable memory mapped mode");
		return ret;
	}

	LOG_DBG("Memory mapped mode enabled");

	return ret;
}

static int mspi_stm32_xspi_context_lock(struct mspi_stm32_context *ctx,
					const struct mspi_xfer *xfer)
{
	if (k_sem_take(&ctx->lock, K_MSEC(xfer->timeout)) < 0) {
		return -EBUSY;
	}

	ctx->xfer = *xfer;
	ctx->packets_left = ctx->xfer.num_packet;
	return 0;
}

static void mspi_stm32_xspi_context_unlock(struct mspi_stm32_context *ctx)
{
	k_sem_give(&ctx->lock);
}

/**
 * Check if the MSPI bus is busy.
 *
 * @param controller MSPI controller device.
 * @return true The MSPI bus is busy.
 * @return false The MSPI bus is idle.
 */
static bool mspi_stm32_xspi_is_inp(const struct device *controller)
{
	struct mspi_stm32_data *dev_data = controller->data;

	return k_sem_count_get(&dev_data->ctx.lock) == 0;
}

static int mspi_stm32_xspi_abort_memmap_if_enabled(const struct device *dev)
{
	int ret = 0;

	if (mspi_stm32_xspi_is_memorymap(dev)) {
		ret = mspi_stm32_xspi_memmap_off(dev);
		if (ret != 0) {
			LOG_ERR("Failed to abort memory-mapped mode.");
			return ret;
		}
	}

	return ret;
}

/**
 * @brief Reads/Writes in memory mapped mode.
 *
 */
static int read_write_in_memory_map_mode(const struct device *dev,
					 const struct mspi_xfer_packet *packet)
{
	int ret;
	struct mspi_stm32_data *dev_data = dev->data;

	if (packet->data_buf == NULL) {
		LOG_ERR("data buf is null : 0x%x", packet->cmd);
		return -EIO;
	}

	xspi_lock_thread(dev);
	if (!mspi_stm32_xspi_is_memorymap(dev)) {
		ret = mspi_stm32_xspi_memmap_on(dev);
		if (ret != 0) {
			LOG_ERR("Failed to set memory mapped");
			xspi_unlock_thread(dev);
			return ret;
		}
	}
	xspi_unlock_thread(dev);

	/* The address of the Memory Mapped area includes the offset hold by the memmap-config */
	uintptr_t mmap_addr = dev_data->memmap_base_addr +
		dev_data->memmap_cfg.address_offset +
		packet->address;

	/* TODO :
	 * - check this mmap_addr does not exceed the max_mmap_addr = dev_data->memmap_base_addr +
	 * dev_data->memmap_cfg.address_offset + dev_data->memmap_cfg.size
	 * - check that the mmap_addr + packet->num_bytes does not exceed the max_mmap_addr
	 */

	if (packet->dir == MSPI_RX) {
#ifdef CONFIG_DCACHE
		/* Invalidating an un-aligned cache line is safe as data cache cannot be more
		 * recent than flash memory when reading. Compute aligned address to be safe
		 * against possibles sanity tests in data cache management functions.
		 */
		uintptr_t base = ROUND_DOWN(mmap_addr, CONFIG_DCACHE_LINE_SIZE);
		uintptr_t end = ROUND_UP(mmap_addr + packet->num_bytes, CONFIG_DCACHE_LINE_SIZE);

		sys_cache_data_invd_range((void *)base, end - base);
#endif
		LOG_INF("Memory-mapped read from 0x%08lx, len %u", mmap_addr, packet->num_bytes);
		memcpy(packet->data_buf, (void *)mmap_addr, packet->num_bytes);
		k_sleep(K_MSEC(1));
		return 0;
	}

	if (!dev_data->memmap_cfg.permission) {
		LOG_INF("Memory-mapped write from 0x%08lx, len %u", mmap_addr, packet->num_bytes);
		memcpy((void *)mmap_addr, packet->data_buf, packet->num_bytes);
		k_sleep(K_MSEC(1));
		return 0;
	}

	xspi_lock_thread(dev);
	ret = mspi_stm32_xspi_abort_memmap_if_enabled(dev);
	xspi_unlock_thread(dev);
	if (ret != 0) {
		return ret;
	}

	return -EPROTONOSUPPORT;
}

static int read_write_in_indirect_mode(const struct device *dev,
				       const struct mspi_xfer_packet *packet,
				       uint8_t access_mode)
{
	int hal_ret;
	struct mspi_stm32_data *dev_data = dev->data;

	if (packet->dir == MSPI_RX) {
		/* Receive the data */
		switch (access_mode) {
		case MSPI_ACCESS_SYNC:
			hal_ret = HAL_XSPI_Receive(&dev_data->hmspi.xspi, packet->data_buf,
						   MSPI_STM32_XSPI_TIMEOUT_MS);
			goto end;
		case MSPI_ACCESS_ASYNC:
			hal_ret = HAL_XSPI_Receive_IT(&dev_data->hmspi.xspi, packet->data_buf);
			break;
		case MSPI_ACCESS_DMA:
			uint8_t *dma_buf = k_aligned_alloc(CONFIG_MSPI_STM32_BUFFER_ALIGNMENT,
							   packet->num_bytes);

			if (dma_buf == NULL) {
				LOG_ERR("DMA buffer allocation failed");
				return -EIO;
			}

			hal_ret = HAL_XSPI_Receive_DMA(&dev_data->hmspi.xspi, dma_buf);
			if (hal_ret == HAL_OK) {
				if (k_sem_take(&dev_data->sync, K_FOREVER) < 0) {
					LOG_ERR("Failed to take sem");
					k_free(dma_buf);
					return -EIO;
				}
				memcpy(packet->data_buf, dma_buf, packet->num_bytes);
			}

			k_free(dma_buf);
			goto end;
		default:
			/* Not correct */
			hal_ret = HAL_BUSY;
			break;
		}
	} else {
		/* Transmit the data */
		switch (access_mode) {
		case MSPI_ACCESS_SYNC:
			hal_ret = HAL_XSPI_Transmit(&dev_data->hmspi.xspi, packet->data_buf,
						    MSPI_STM32_XSPI_TIMEOUT_MS);
			goto end;
		case MSPI_ACCESS_ASYNC:
			hal_ret = HAL_XSPI_Transmit_IT(&dev_data->hmspi.xspi, packet->data_buf);
			break;
		case MSPI_ACCESS_DMA:
			hal_ret = HAL_XSPI_Transmit_DMA(&dev_data->hmspi.xspi, packet->data_buf);
			break;
		default:
			/* Not correct */
			hal_ret = HAL_BUSY;
			break;
		}
	}

	if (hal_ret != HAL_OK) {
		goto end;
	}

	/* Lock again expecting the IRQ for end of Tx or Rx */
	if (k_sem_take(&dev_data->sync, K_FOREVER) < 0) {
		LOG_ERR("Failed to take sem");
		return -EIO;
	}

end:
	if (hal_ret != HAL_OK) {
		LOG_ERR("Failed to access data");
		return -EIO;
	}

