zephyrproject-rtos/zephyr/drivers/mspi/mspi_stm32_xspi.c
	return 0;
}
/**
 * @brief Sends a Command to the NOR and Receive/Transceive data if relevant in IT or DMA mode.
 *
 */
static int mspi_stm32_xspi_access(const struct device *dev, const struct mspi_xfer_packet *packet,
				  uint8_t access_mode)
{
	int ret;
	struct mspi_stm32_data *dev_data = dev->data;

	if (dev_data->memmap_cfg.enable) {
		if ((packet->cmd == MSPI_NOR_CMD_WREN) || (packet->cmd == MSPI_NOR_OCMD_WREN) ||
		    (packet->cmd == MSPI_NOR_CMD_SE_4B) || (packet->cmd == MSPI_NOR_OCMD_SE) ||
		    (packet->cmd == MSPI_NOR_CMD_SE) ||
		    ((dev_data->dev_cfg.addr_length != 4U) &&
		     (dev_data->dev_cfg.io_mode == MSPI_IO_MODE_SINGLE))) {
			LOG_DBG(" MSPI_IO_MODE_SINGLE in 3Bytes addressing is not supported in "
				"memory map mode, switching to indirect mode");

			xspi_lock_thread(dev);

			ret = mspi_stm32_xspi_abort_memmap_if_enabled(dev);

			xspi_unlock_thread(dev);
			if (ret != 0) {
				return ret;
			}

			goto indirect;
		}

		if (read_write_in_memory_map_mode(dev, packet) == -EPROTONOSUPPORT) {
			goto indirect;
		}
		return 0;
	}

indirect:
	(void)pm_device_runtime_get(dev);
	/* Prevent the clocks to be stopped during the request */
	pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);

	struct mspi_stm32_xspi_cmd cmd = {
		.op_type = MSPI_STM32_XSPI_CMD_COMMON_CFG,
		.instruction = packet->cmd,
		.addr = packet->address,
		.addr_length = (dev_data->ctx.xfer.addr_length == 4U) ? 4U : 3U,
		.dummy_cycles = (packet->dir == MSPI_TX) ? dev_data->ctx.xfer.tx_dummy
							 : dev_data->ctx.xfer.rx_dummy,
		.num_bytes = packet->num_bytes,
		.data_none = (packet->num_bytes == 0U),
	};

	if (dev_data->ctx.xfer.addr_length == 0) {
		/* Commands without an address phase, e.g. RDID or WREN */
		cmd.addr_length = 0;
	}

	LOG_DBG("MSPI access Instruction 0x%x", packet->cmd);

	ret = mspi_stm32_xspi_send_cmd(dev, dev_data->dev_cfg.io_mode,
				       dev_data->dev_cfg.data_rate, &cmd);
	if ((ret != 0) || (packet->num_bytes == 0)) {
		pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
		(void)pm_device_runtime_put(dev);
		if (ret != 0) {
			LOG_ERR("Failed to send XSPI instruction");
			return -EIO;
		}
		return 0;
	}

	ret = read_write_in_indirect_mode(dev, packet, access_mode);

	/* Async path: handled in ISR callback, so skip PM release here. */
	if ((ret == 0) && (access_mode == MSPI_ACCESS_ASYNC)) {
		return 0;
	}

	pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	(void)pm_device_runtime_put(dev);

	if (ret != 0) {
		LOG_ERR("Failed to access data");
		return -EIO;
	}

	return 0;
}

/* Start Automatic-Polling mode to wait until the memory is setting mask/value bit */
static int mspi_stm32_xspi_wait_auto_polling(const struct device *dev, uint8_t match_value,
					     uint8_t match_mask, uint32_t timeout_ms)
{
	struct mspi_stm32_data *dev_data = dev->data;

	(void)pm_device_runtime_get(dev);
	/* Prevent the clocks to be stopped during the request */
	pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);

	if (mspi_stm32_xspi_autopoll_start(dev, match_value, match_mask) != 0) {
		LOG_ERR("XSPI AutoPoll failed");
		pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
		(void)pm_device_runtime_put(dev);
		return -EIO;
	}

	if (k_sem_take(&dev_data->sync, K_MSEC(timeout_ms)) < 0) {
		LOG_ERR("XSPI AutoPoll wait failed");
		/* Best-effort cleanup: -EIO is returned either way, but a failed
		 * abort likely leaves the controller stuck, so make it visible.
		 */
		if (mspi_stm32_xspi_abort(dev) != 0) {
			LOG_WRN("XSPI abort after autopoll timeout failed");
		}
		k_sem_reset(&dev_data->sync);
		pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
		(void)pm_device_runtime_put(dev);
		return -EIO;
	}

	return 0;
}

/*
 * Reads the status reg of the device
 * Send the RDSR command (according to io_mode/data_rate)
 * Then sets the Autopolling mode with match mask/value bit.
 */
static int mspi_stm32_xspi_status_reg(const struct device *controller, const struct mspi_xfer *xfer)
{
	int ret = 0;
	struct mspi_stm32_data *dev_data = controller->data;
	struct mspi_stm32_context *ctx = &dev_data->ctx;
	uint8_t io_mode = dev_data->dev_cfg.io_mode;

	if (xfer->num_packet == 0 || xfer->packets == NULL) {
		LOG_ERR("Status Reg.: wrong parameters");
		return -EFAULT;
	}

	ret = mspi_stm32_xspi_context_lock(ctx, xfer);
	if (ret != 0) {
		return ret;
	}

	(void)pm_device_runtime_get(controller);
	/* Prevent the clocks to be stopped during the request */
	pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);

	/* num_bytes stays 0 with an active data phase: the RDSR data is
	 * consumed by the autopolling engine, not read out here.
	 */
	struct mspi_stm32_xspi_cmd cmd = {
		.op_type = MSPI_STM32_XSPI_CMD_COMMON_CFG,
		.addr = 0U,
	};

	if (io_mode == MSPI_IO_MODE_OCTAL) {
		cmd.instruction = MSPI_NOR_OCMD_RDSR;
		cmd.addr_length = 4U;
		cmd.dummy_cycles = (dev_data->dev_cfg.data_rate == MSPI_DATA_RATE_DUAL)
					  ? MSPI_NOR_DUMMY_REG_OCTAL_DTR
					  : MSPI_NOR_DUMMY_REG_OCTAL;
	} else {
		/* Plain RDSR: single-line command without an address phase */
		cmd.instruction = MSPI_NOR_CMD_RDSR;
		cmd.addr_length = 0U;
		cmd.dummy_cycles = 0U;
		io_mode = MSPI_IO_MODE_SINGLE;
	}
	LOG_DBG("MSPI poll status reg");

	xspi_lock_thread(controller);
	ret = mspi_stm32_xspi_abort_memmap_if_enabled(controller);
	xspi_unlock_thread(controller);
	if (ret != 0) {
		goto status_end;
	}

	ret = mspi_stm32_xspi_send_cmd(controller, io_mode, dev_data->dev_cfg.data_rate, &cmd);
	if (ret != 0) {
		LOG_ERR("Failed to send XSPI instruction");
		goto status_end;
	}

	ret = mspi_stm32_xspi_wait_auto_polling(controller, MSPI_NOR_MEM_RDY_MATCH,
						MSPI_NOR_MEM_RDY_MASK,
						MSPI_STM32_XSPI_TIMEOUT_MS);

status_end:
	pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	(void)pm_device_runtime_put(controller);

	mspi_stm32_xspi_context_unlock(ctx);
	return ret;
}

static void mspi_stm32_xspi_isr(const struct device *dev)
{
	struct mspi_stm32_data *dev_data = dev->data;

	HAL_XSPI_IRQHandler(&dev_data->hmspi.xspi);

	k_sem_give(&dev_data->sync);
	pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	(void)pm_device_runtime_put(dev);
}

#ifdef CONFIG_MSPI_DMA
static __maybe_unused void mspi_stm32_xspi_dma_callback(const struct device *dev, void *arg,
							uint32_t channel, int status)
{
	ARG_UNUSED(dev);

	if (status < 0) {
		LOG_ERR("DMA callback error with channel %d", channel);
	}

	HAL_DMA_IRQHandler(arg);
}
#endif

static int mspi_stm32_xspi_validate_freq(uint32_t freq, uint32_t max_freq)
{
	if (freq > max_freq) {
		LOG_ERR("%u, freq is too large", __LINE__);
		return -ENOTSUP;
	}
	return 0;
}

