zephyrproject-rtos/zephyr/drivers/mspi/mspi_stm32_xspi.c
static int mspi_stm32_xspi_validate_io_mode(uint32_t io_mode)
{
	if (io_mode >= MSPI_IO_MODE_MAX) {
		LOG_ERR("%u, Invalid io_mode", __LINE__);
		return -EINVAL;
	}
	return 0;
}

static int mspi_stm32_xspi_validate_data_rate(uint32_t data_rate)
{
	if (data_rate >= MSPI_DATA_RATE_MAX) {
		LOG_ERR("%u, Invalid data_rate", __LINE__);
		return -EINVAL;
	}
	return 0;
}

static int mspi_stm32_xspi_validate_cpp(uint32_t cpp)
{
	if (cpp > MSPI_CPP_MODE_3) {
		LOG_ERR("%u, Invalid cpp", __LINE__);
		return -EINVAL;
	}
	return 0;
}

static int mspi_stm32_xspi_validate_endian(uint32_t endian)
{
	if (endian > MSPI_XFER_BIG_ENDIAN) {
		LOG_ERR("%u, Invalid endian", __LINE__);
		return -EINVAL;
	}
	return 0;
}

static int mspi_stm32_xspi_validate_ce_polarity(uint32_t ce_polarity)
{
	if (ce_polarity > MSPI_CE_ACTIVE_HIGH) {
		LOG_ERR("%u, Invalid ce_polarity", __LINE__);
		return -EINVAL;
	}
	return 0;
}

static int mspi_stm32_xspi_validate_dqs(bool dqs_enable, bool dqs_support)
{
	if (dqs_enable && !dqs_support) {
		LOG_ERR("%u, DQS mode not supported", __LINE__);
		return -ENOTSUP;
	}
	return 0;
}

static int mspi_stm32_assign_cfg(struct mspi_stm32_data *data,
				 const enum mspi_dev_cfg_mask param_mask,
				 const struct mspi_dev_cfg *dev_cfg,
				 const struct mspi_stm32_conf *cfg)
{
	int ret = 0;

	if ((param_mask & MSPI_DEVICE_CONFIG_RX_DUMMY) != 0) {
		data->dev_cfg.rx_dummy = dev_cfg->rx_dummy;
	}

	if ((param_mask & MSPI_DEVICE_CONFIG_TX_DUMMY) != 0) {
		data->dev_cfg.tx_dummy = dev_cfg->tx_dummy;
	}

	if ((param_mask & MSPI_DEVICE_CONFIG_READ_CMD) != 0) {
		data->dev_cfg.read_cmd = dev_cfg->read_cmd;
	}

	if ((param_mask & MSPI_DEVICE_CONFIG_WRITE_CMD) != 0) {
		data->dev_cfg.write_cmd = dev_cfg->write_cmd;
	}

	if ((param_mask & MSPI_DEVICE_CONFIG_CMD_LEN) != 0) {
		data->dev_cfg.cmd_length = dev_cfg->cmd_length;
	}

	if ((param_mask & MSPI_DEVICE_CONFIG_ADDR_LEN) != 0) {
		data->dev_cfg.addr_length = dev_cfg->addr_length;
	}

	if ((param_mask & MSPI_DEVICE_CONFIG_MEM_BOUND) != 0) {
		data->dev_cfg.mem_boundary = dev_cfg->mem_boundary;
	}

	if ((param_mask & MSPI_DEVICE_CONFIG_BREAK_TIME) != 0) {
		data->dev_cfg.time_to_break = dev_cfg->time_to_break;
	}
	if ((param_mask & MSPI_DEVICE_CONFIG_CE_POL) != 0) {
		ret = mspi_stm32_xspi_validate_ce_polarity(dev_cfg->ce_polarity);
		if (ret != 0) {
			goto end;
		}
		data->dev_cfg.ce_polarity = dev_cfg->ce_polarity;
	}

	if ((param_mask & MSPI_DEVICE_CONFIG_DQS) != 0) {
		ret = mspi_stm32_xspi_validate_dqs(dev_cfg->dqs_enable, cfg->mspicfg.dqs_support);
		if (ret != 0) {
			goto end;
		}
		data->dev_cfg.dqs_enable = dev_cfg->dqs_enable;
	}

	if ((param_mask & MSPI_DEVICE_CONFIG_ENDIAN) != 0) {
		ret = mspi_stm32_xspi_validate_endian(dev_cfg->endian);
		if (ret != 0) {
			goto end;
		}
		data->dev_cfg.endian = dev_cfg->endian;
	}
end:
	return ret;
}

/**
 * Check and save dev_cfg to controller data->dev_cfg.
 *
 * @param controller Pointer to the device structure for the driver instance.
 * @param param_mask Macro definition of what to be configured in cfg.
 * @param dev_cfg The device runtime configuration for the MSPI controller.
 * @return 0 MSPI device configuration successful.
 * @return A negative errno value upon MSPI device configuration failure.
 */
static int mspi_stm32_xspi_dev_cfg_save(const struct device *controller,
					const enum mspi_dev_cfg_mask param_mask,
					const struct mspi_dev_cfg *dev_cfg)
{
	const struct mspi_stm32_conf *cfg = controller->config;
	struct mspi_stm32_data *data = controller->data;
	int ret = 0;

	if ((param_mask & MSPI_DEVICE_CONFIG_CE_NUM) != 0) {
		data->dev_cfg.ce_num = dev_cfg->ce_num;
	}

	if ((param_mask & MSPI_DEVICE_CONFIG_FREQUENCY) != 0) {
		ret = mspi_stm32_xspi_validate_freq(dev_cfg->freq, cfg->mspicfg.max_freq);
		if (ret != 0) {
			goto end;
		}
		data->dev_cfg.freq = dev_cfg->freq;
	}

	if ((param_mask & MSPI_DEVICE_CONFIG_IO_MODE) != 0) {
		ret = mspi_stm32_xspi_validate_io_mode(dev_cfg->io_mode);
		if (ret != 0) {
			goto end;
		}
		data->dev_cfg.io_mode = dev_cfg->io_mode;
	}

	if ((param_mask & MSPI_DEVICE_CONFIG_DATA_RATE) != 0) {
		ret = mspi_stm32_xspi_validate_data_rate(dev_cfg->data_rate);
		if (ret != 0) {
			goto end;
		}
		data->dev_cfg.data_rate = dev_cfg->data_rate;
	}

	if ((param_mask & MSPI_DEVICE_CONFIG_CPP) != 0) {
		ret = mspi_stm32_xspi_validate_cpp(dev_cfg->cpp);
		if (ret != 0) {
			goto end;
		}
		data->dev_cfg.cpp = dev_cfg->cpp;
	}

	mspi_stm32_assign_cfg(data, param_mask, dev_cfg, cfg);
end:
	return ret;
}

/**
 * API implementation of mspi_dev_config : controller device specific configuration
 *
 * @param controller Pointer to the device structure for the driver instance.
 * @param dev_id Pointer to the device ID structure from a device.
 * @param param_mask Macro definition of what to be configured in cfg.
 * @param dev_cfg The device runtime configuration for the MSPI controller.
 *
 * @retval 0 if successful.
 * @retval A negative errno value upon failure.
 */
static int mspi_stm32_xspi_dev_config(const struct device *controller,
				      const struct mspi_dev_id *dev_id,
				      const enum mspi_dev_cfg_mask param_mask,
				      const struct mspi_dev_cfg *dev_cfg)
{
	int ret = 0;
	bool locked = false;
	const struct mspi_stm32_conf *cfg = controller->config;
	struct mspi_stm32_data *data = controller->data;

	if (data->dev_id != dev_id) {
		/* The controller lock is taken here and kept for the whole
		 * session, until the device releases it through
		 * mspi_get_channel_status().
		 */
		if (k_mutex_lock(&data->lock, K_MSEC(CONFIG_MSPI_COMPLETION_TIMEOUT_TOLERANCE))) {
			LOG_ERR("MSPI config failed to access controller");
			return -EBUSY;
		}

		locked = true;
	}

	if (mspi_stm32_xspi_is_inp(controller)) {
		ret = -EBUSY;
		goto e_return;
	}

	data->dev_id = dev_id;

	if (param_mask == MSPI_DEVICE_CONFIG_NONE && !cfg->mspicfg.sw_multi_periph) {
		return 0;
	}

	/* Go on with other parameters if supported */
	if (mspi_stm32_xspi_dev_cfg_save(controller, param_mask, dev_cfg) != 0) {
		LOG_ERR("failed to change device cfg");
		ret = -EIO;
		goto e_return;
	}

