zephyrproject-rtos/zephyr/drivers/mspi/mspi_stm32_xspi.c
	return 0;

e_return:
	if (locked) {
		data->dev_id = NULL;
		k_mutex_unlock(&data->lock);
	}
	return ret;
}

/**
 * API implementation of mspi_memmap_config : XIP configuration
 *
 * @param controller Pointer to the device structure for the driver instance.
 * @param dev_id Pointer to the device ID structure from a device.
 * @param memmap_cfg The controller XIP configuration for MSPI.
 *
 * @retval 0 if successful.
 * @retval A negative errno value upon failure.
 */
static int mspi_stm32_xspi_memmap_config(const struct device *controller,
					 const struct mspi_dev_id *dev_id,
					 const struct mspi_memmap_cfg *memmap_cfg)
{
	int ret = 0;
	struct mspi_stm32_data *dev_data = controller->data;

	if (dev_id != dev_data->dev_id) {
		LOG_ERR("dev_id don't match");
		return -ESTALE;
	}
	(void)pm_device_runtime_get(controller);
	/* Prevent the clocks to be stopped during the request */
	pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	xspi_lock_thread(controller);

	if (!memmap_cfg->enable) {
		/* Abort memory-mapped mode only if it was enabled. This avoids
		 * a possible assert when USE_ASSERT_DBG_STATE is enabled on
		 * devices using the HAL2 XSPI driver underneath.
		 */
		ret = mspi_stm32_xspi_abort_memmap_if_enabled(controller);
	} else {
		ret = mspi_stm32_xspi_memmap_on(controller);
	}

	if (ret == 0) {
		dev_data->memmap_cfg = *memmap_cfg;
		LOG_INF("XIP configured %d", memmap_cfg->enable);
	}

	xspi_unlock_thread(controller);
	pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	(void)pm_device_runtime_put(controller);
	return ret;
}

/**
 * API implementation of mspi_get_channel_status.
 *
 * @param controller Pointer to the device structure for the driver instance.
 * @param ch Not used.
 *
 * @retval 0 if successful.
 * @retval A negative errno value upon failure.
 */
static int mspi_stm32_xspi_get_channel_status(const struct device *controller, uint8_t ch)
{
	struct mspi_stm32_data *dev_data = controller->data;

	ARG_UNUSED(ch);

	if (mspi_stm32_xspi_is_inp(controller) || mspi_stm32_xspi_is_busy(controller)) {
		return -EBUSY;
	}

	/* The controller is idle: end the session started by
	 * mspi_dev_config() and release the controller lock.
	 */
	dev_data->dev_id = NULL;
	k_mutex_unlock(&dev_data->lock);

	return 0;
}

static int mspi_stm32_xspi_pio_dma_transceive(const struct device *controller,
					      const struct mspi_xfer *xfer)
{
	int ret = 0;
	uint32_t packet_idx;
	struct mspi_stm32_data *dev_data = controller->data;
	struct mspi_stm32_context *ctx = &dev_data->ctx;
	const struct mspi_xfer_packet *packet;

	if (xfer->num_packet == 0 || xfer->packets == NULL ||
	    xfer->timeout > CONFIG_MSPI_COMPLETION_TIMEOUT_TOLERANCE) {
		LOG_ERR("Transfer: wrong parameters");
		return -EFAULT;
	}

	ret = mspi_stm32_xspi_context_lock(ctx, xfer);
	if (ret != 0) {
		LOG_ERR("Failed to lock MSPI context");
		return ret;
	}

	while (ctx->packets_left > 0) {
		packet_idx = ctx->xfer.num_packet - ctx->packets_left;
		packet = &ctx->xfer.packets[packet_idx];
#ifdef CONFIG_MSPI_DMA
		const struct mspi_stm32_conf *dev_cfg = controller->config;

		if (dev_cfg->dma_specified) {
			ret = mspi_stm32_xspi_access(controller, packet, MSPI_ACCESS_DMA);
		} else {
			LOG_ERR("DMA configuration is missing from the device tree");
			ret = -EIO;
			goto end;
		}
#else
		ret = mspi_stm32_xspi_access(controller, packet,
					     ctx->xfer.async ? MSPI_ACCESS_ASYNC :
							       MSPI_ACCESS_SYNC);
#endif

		ctx->packets_left--;
		if (ret != 0) {
			ret = -EIO;
			goto end;
		}
	}

end:
	mspi_stm32_xspi_context_unlock(ctx);
	return ret;
}

/**
 * API implementation of mspi_transceive.
 *
 * @param controller Pointer to the device structure for the driver instance.
 * @param dev_id Pointer to the device ID structure from a device.
 * @param xfer Pointer to the MSPI transfer started by dev_id.
 *
 * @retval 0 if successful.
 * @retval A negative errno value upon failure.
 */
static int mspi_stm32_xspi_transceive(const struct device *controller,
				      const struct mspi_dev_id *dev_id,
				      const struct mspi_xfer *xfer)
{
	int ret = 0;
	struct mspi_stm32_data *dev_data = controller->data;

	if (dev_id != dev_data->dev_id) {
		LOG_ERR("transceive : dev_id don't match");
		return -ESTALE;
	}

	if (xfer->xfer_mode == MSPI_MEMMAP) {
		LOG_ERR("transceive : memory mapped transfers are not supported");
		return -ENOTSUP;
	}

	/* Need to map the xfer to the data context */
	dev_data->ctx.xfer = *xfer;

	if ((xfer->packets->cmd == MSPI_NOR_OCMD_RDSR) ||
	    (xfer->packets->cmd == MSPI_NOR_CMD_RDSR)) {
		ret = mspi_stm32_xspi_status_reg(controller, xfer);
	} else {
		ret = mspi_stm32_xspi_pio_dma_transceive(controller, xfer);
	}

	return ret;
}

static int mspi_validate_config(const struct mspi_cfg *config, uint32_t max_frequency)
{
	if (config->op_mode != MSPI_OP_MODE_CONTROLLER) {
		LOG_ERR("Only support MSPI controller mode");
		return -ENOTSUP;
	}

	if (config->max_freq > max_frequency) {
		LOG_ERR("Max_freq %d too large", config->max_freq);
		return -ENOTSUP;
	}

	if (config->duplex != MSPI_HALF_DUPLEX) {
		LOG_ERR("Only support half duplex mode");
		return -ENOTSUP;
	}

	if (config->num_periph > MSPI_MAX_DEVICE) {
		LOG_ERR("Invalid MSPI peripheral number");
		return -ENOTSUP;
	}

	return 0;
}

static int mspi_stm32_xspi_activate(const struct device *dev)
{
	int ret;
	const struct mspi_stm32_conf *config = (struct mspi_stm32_conf *)dev->config;
	const struct device *const clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);

	ret = pinctrl_apply_state(config->pcfg, PINCTRL_STATE_DEFAULT);
	if (ret < 0) {
		return ret;
	}

	if (clock_control_on(clk, (clock_control_subsys_t)(uintptr_t)&config->pclken[0]) != 0) {
		return -EIO;
	}

	return 0;
}

static __maybe_unused int mspi_dma_setup(const struct mspi_stm32_conf *dev_cfg,
					 struct mspi_stm32_data *dev_data)
{
	if (!dev_cfg->dma_specified) {
		LOG_ERR("DMA configuration is missing from the device tree");
		return -EIO;
	}

	if (mspi_stm32_xspi_dma_init(&dev_data->hdma_tx, &dev_data->dma_tx) != 0) {
		LOG_ERR("XSPI DMA Tx init failed");
		return -EIO;
	}
	if (mspi_stm32_xspi_dma_link_tx(dev_data) != 0) {
		LOG_ERR("XSPI DMA Tx link failed");
		return -EIO;
	}

	if (mspi_stm32_xspi_dma_init(&dev_data->hdma_rx, &dev_data->dma_rx) != 0) {
		LOG_ERR("XSPI DMA Rx init failed");
		return -EIO;
	}
	if (mspi_stm32_xspi_dma_link_rx(dev_data) != 0) {
		LOG_ERR("XSPI DMA Rx link failed");
		return -EIO;
	}

