zephyrproject-rtos/zephyr/drivers/mspi/mspi_stm32_xspi.c
	return 0;
}

/**
 * API implementation of mspi_config : controller configuration.
 *
 * @param spec Pointer to MSPI device tree spec.
 * @return 0 if successful.
 * @return A negative errno value upon failure.
 */
static int mspi_stm32_xspi_config(const struct mspi_dt_spec *spec)
{
	int ret;
	const struct mspi_cfg *config = &spec->config;
	const struct mspi_stm32_conf *dev_cfg = spec->bus->config;
	struct mspi_stm32_data *dev_data = spec->bus->data;
	uint32_t ahb_clock_freq;

	ret = mspi_validate_config(config, dev_cfg->mspicfg.max_freq);
	if (ret != 0) {
		return ret;
	}

	(void)pm_device_runtime_get(spec->bus);
	/* Prevent the clocks to be stopped during the request */
	pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);

	/* pinctrl */
	ret = pinctrl_apply_state(dev_cfg->pcfg, PINCTRL_STATE_DEFAULT);
	if (ret < 0) {
		LOG_ERR("MSPI pinctrl setup failed");
		goto end;
	}

	if (dev_data->dev_cfg.dqs_enable && !dev_cfg->mspicfg.dqs_support) {
		LOG_ERR("MSPI dqs mismatch (not supported but enabled)");
		ret = -ENOTSUP;
		goto end;
	}

	dev_cfg->irq_config();

	ret = mspi_stm32_xspi_activate(spec->bus);
	if (ret != 0) {
		goto end;
	}

	if (clock_control_get_rate(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
				   (clock_control_subsys_t)&dev_cfg->pclken[0],
				   &ahb_clock_freq) < 0) {
		LOG_ERR("Failed call clock_control_get_rate(pclken)");
		ret = -EIO;
		goto end;
	}

#ifdef CONFIG_MSPI_DMA
	if (dev_cfg->dma_specified) {
		dev_data->dma_tx.reg = (DMA_TypeDef *)dev_data->dma_tx.phys_addr;
		dev_data->dma_rx.reg = (DMA_TypeDef *)dev_data->dma_rx.phys_addr;
	}
#endif

	ret = mspi_hal_init(dev_cfg, dev_data, ahb_clock_freq);
	if (ret != 0) {
		goto end;
	}

	ret = mspi_configure_delay_block(dev_data);
	if (ret != 0) {
		goto end;
	}

#ifdef CONFIG_MSPI_DMA
	ret = mspi_dma_setup(dev_cfg, dev_data);
	if (ret != 0) {
		goto end;
	}
#endif

	if (k_sem_count_get(&dev_data->ctx.lock) == 0) {
		k_sem_give(&dev_data->ctx.lock);
	}
	if (config->re_init) {
		/* Force-release a session that may still hold the lock */
		dev_data->dev_id = NULL;
		k_mutex_unlock(&dev_data->lock);
	}

	k_sem_init(&dev_data->thread_sem, 1, 1);

end:
	pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	(void)pm_device_runtime_put(spec->bus);

	if (ret == 0) {
		LOG_INF("MSPI configured");
	}

	return ret;
}

/**
 * Set up and config a new controller.
 *
 * @param dev MSPI controller.
 *
 * @retval 0 if successful.
 */
static int mspi_stm32_init(const struct device *controller)
{
	const struct mspi_stm32_conf *cfg = controller->config;
	const struct mspi_dt_spec spec = {
		.bus = controller,
		.config = cfg->mspicfg,
	};

	return mspi_stm32_xspi_config(&spec);
}

#if defined(CONFIG_MSPI_TIMING)
static int mspi_stm32_timing_config(const struct device *dev,
				    const struct mspi_dev_id *dev_id,
				    const uint32_t param_mask, void *cfg)
{
	struct mspi_stm32_data *dev_data = dev->data;
	struct mspi_stm32_timing_cfg *config = cfg;

	if (config->turnaround_cycles != 0) {
		/* Required for PSRAM where tx_dummy = total latency (WLC),
		 * while STM32 XSPI expects dummy cycles excluding turnaround.
		 */
		dev_data->dev_cfg.tx_dummy = dev_data->dev_cfg.tx_dummy - config->turnaround_cycles;
	}

	return 0;
}
#endif /* defined(CONFIG_MSPI_TIMING) */

static DEVICE_API(mspi, mspi_stm32_driver_api) = {
	.config = mspi_stm32_xspi_config,
	.dev_config = mspi_stm32_xspi_dev_config,
	.memmap_config = mspi_stm32_xspi_memmap_config,
	.get_channel_status = mspi_stm32_xspi_get_channel_status,
	.transceive = mspi_stm32_xspi_transceive,
#if defined(CONFIG_MSPI_TIMING)
	.timing_config = mspi_stm32_timing_config,
#endif
};

#ifdef CONFIG_PM_DEVICE
static int mspi_stm32_xspi_suspend(const struct device *dev)
{
	int ret;
	const struct mspi_stm32_conf *cfg = (struct mspi_stm32_conf *)dev->config;
	const struct device *const clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);

	/* Disable device clock. */
	ret = clock_control_off(clk, (clock_control_subsys_t)(uintptr_t)&cfg->pclken[0]);
	if (ret < 0) {
		LOG_ERR("Failed to disable MSPI clock during PM suspend process");
		return ret;
	}

	/* Move pins to sleep state */
	ret = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_SLEEP);
	if (ret == -ENOENT) {
		/* Warn but don't block suspend */
		LOG_WRN_ONCE("MSPI pinctrl sleep state not available");
		return 0;
	}

	return ret;
}

static int mspi_stm32_xspi_pm_action(const struct device *dev, enum pm_device_action action)
{
	switch (action) {
	case PM_DEVICE_ACTION_RESUME:
		return mspi_stm32_xspi_activate(dev);
	case PM_DEVICE_ACTION_SUSPEND:
		return mspi_stm32_xspi_suspend(dev);
	default:
		return -ENOTSUP;
	}
}
#endif /* CONFIG_PM_DEVICE */

#ifdef CONFIG_MSPI_DMA
#define DMA_CHANNEL_CONFIG(node, dir) DT_DMAS_CELL_BY_NAME(node, dir, channel_config)

#define XSPI_DMA_CHANNEL_INIT(node, dir, dir_cap, src_dev, dest_dev)                              \
	.dev = DEVICE_DT_GET(DT_DMAS_CTLR(node)),                                                 \
	.channel = DT_DMAS_CELL_BY_NAME(node, dir, channel),                                      \
	.phys_addr = DT_REG_ADDR(DT_DMAS_CTLR(node)),                                              \
	.cfg = {                                                                                  \
		.dma_slot = DT_DMAS_CELL_BY_NAME(node, dir, slot),                                \
		.channel_direction = STM32_DMA_CONFIG_DIRECTION(DMA_CHANNEL_CONFIG(node, dir)),   \
		.channel_priority = STM32_DMA_CONFIG_PRIORITY(DMA_CHANNEL_CONFIG(node, dir)),     \
		.dma_callback = mspi_stm32_xspi_dma_callback,                                     \
	},                                                                                        \
	.src_addr_increment =                                                                     \
		STM32_DMA_CONFIG_##src_dev##_ADDR_INC(DMA_CHANNEL_CONFIG(node, dir)),             \
	.dst_addr_increment =                                                                     \
		STM32_DMA_CONFIG_##dest_dev##_ADDR_INC(DMA_CHANNEL_CONFIG(node, dir)),

#define XSPI_DMA_CHANNEL(node, dir, DIR, src, dest)                                               \
	.dma_##dir = {                                                                            \
		COND_CODE_1(DT_DMAS_HAS_NAME(node, dir),                                          \
			(XSPI_DMA_CHANNEL_INIT(node, dir, DIR, src, dest)),                       \
			(NULL))                                                                   \
	},
#else
#define XSPI_DMA_CHANNEL(node, dir, DIR, src, dest)
#endif /* CONFIG_MSPI_DMA */

