zephyrproject-rtos/zephyr/drivers/mspi/mspi_stm32_xspi.c
/* MSPI control config */
#define MSPI_CONFIG(index)                                                                        \
	{                                                                                         \
		.channel_num = 0,                                                                 \
		.op_mode = DT_INST_ENUM_IDX_OR(index, op_mode, MSPI_OP_MODE_CONTROLLER),          \
		.duplex = DT_INST_ENUM_IDX_OR(index, duplex, MSPI_HALF_DUPLEX),                   \
		.max_freq = DT_INST_PROP(index, clock_frequency),                                 \
		.dqs_support = DT_INST_PROP(index, dqs_support),                                  \
		.num_periph = DT_INST_CHILD_NUM(index),                                           \
		.sw_multi_periph = DT_INST_PROP(index, software_multiperipheral),                 \
	}

#define STM32_SMPI_IRQ_HANDLER(index)                                                             \
	static void mspi_stm32_irq_config_func_##index(void)                                      \
	{                                                                                         \
		IRQ_CONNECT(DT_INST_IRQN(index), DT_INST_IRQ(index, priority),                    \
			    mspi_stm32_xspi_isr, DEVICE_DT_INST_GET(index), 0);                   \
		irq_enable(DT_INST_IRQN(index));                                                  \
	}

#define MSPI_STM32_INIT(index)                                                                    \
	static const struct stm32_pclken pclken_##index[] = STM32_DT_INST_CLOCKS(index);          \
	                                                                                          \
	PINCTRL_DT_INST_DEFINE(index);                                                            \
	                                                                                          \
	static struct gpio_dt_spec ce_gpios##index[] = MSPI_CE_GPIOS_DT_SPEC_INST_GET(index);     \
	                                                                                          \
	STM32_SMPI_IRQ_HANDLER(index)                                                             \
	                                                                                          \
	static const struct mspi_stm32_conf mspi_stm32_dev_conf_##index = {                       \
		.base = (void *)DT_INST_REG_ADDR(index),					  \
		.pclken = pclken_##index,                                                         \
		.pclk_len = DT_INST_NUM_CLOCKS(index),                                            \
		.irq_config = mspi_stm32_irq_config_func_##index,                                 \
		.mspicfg = MSPI_CONFIG(index),                                                    \
		.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(index),                                    \
		.mspicfg.num_ce_gpios = ARRAY_SIZE(ce_gpios##index),                              \
		.dma_specified = DT_INST_NODE_HAS_PROP(index, dmas),                              \
		.cs_boundary = DT_INST_PROP(index, st_csbound),                                   \
		.ssht_enable = DT_INST_PROP(index, st_ssht_enable),                               \
		.mem_size = MSPI_STM32_INST_MEM_ADDR_BITS(index, 26) - 1,                         \
		.mem_type = MSPI_STM32_HAL_MEMTYPE(index),                                        \
	};                                                                                        \
	static struct mspi_stm32_data mspi_stm32_dev_data_##index = {                             \
		.memmap_base_addr = DT_INST_REG_ADDR_BY_IDX(index, 1),                            \
		.lock = Z_MUTEX_INITIALIZER(mspi_stm32_dev_data_##index.lock),                    \
		.sync = Z_SEM_INITIALIZER(mspi_stm32_dev_data_##index.sync, 0, 1),                \
		.dev_cfg = {0},                                                                   \
		.memmap_cfg = {0},                                                                \
		.ctx.lock = Z_SEM_INITIALIZER(mspi_stm32_dev_data_##index.ctx.lock, 0, 1),        \
		XSPI_DMA_CHANNEL(DT_DRV_INST(index), tx, TX, MEMORY, PERIPHERAL)                  \
		XSPI_DMA_CHANNEL(DT_DRV_INST(index), rx, RX, PERIPHERAL, MEMORY)                  \
	};                                                                                        \
                                                                                                  \
	PM_DEVICE_DT_INST_DEFINE(index, mspi_stm32_xspi_pm_action);                               \
	DEVICE_DT_INST_DEFINE(index, &mspi_stm32_init, PM_DEVICE_DT_INST_GET(index),              \
			      &mspi_stm32_dev_data_##index, &mspi_stm32_dev_conf_##index,         \
			      POST_KERNEL, CONFIG_KERNEL_INIT_PRIORITY_DEVICE,                    \
			      &mspi_stm32_driver_api);

DT_INST_FOREACH_STATUS_OKAY(MSPI_STM32_INIT)
